import react from "react";

const Home = () => {
    return (
        <div className="home">
            <h1  className='page-heading'>Головна</h1>
            <div className="container">
            <h2>Про нас</h2>
            <p>Профком студентів УжНУ сягає своїми коріннями у 1987 рік. З того часу первинна профспілкова організація студентів захищає права студентського та аспірантського складу університету.</p>
            <p>Кожен член студентської профспілки користується такими правами:</p>
            <ol>
                <li>Можливість захисту профспілкою прав та інтересів студентів.</li>
                <li>Можливість брати участь в громадському житті та управлінні університетом.</li>
                <li>У разі потреби одержувати матеріальну допомогу.</li>
                <li>Отримувати путівки на лікування та відпочинок за пільговими цінами тощо</li>
                <li>Одержувати пільгові або безкоштовні квитки на заходи культурно-розважального характеру</li>
                <li>Здобувати від адміністрації премії за активну університетську діяльність.</li>
                <li>Брати участь у поїздках історичними місцями України</li>
                <li>Забезпечення міжнародними студентськими квитками – ISIC.</li>
            </ol>

            <p>Відповідно до Закону України "Про профспілки, їх права та гарантії діяльності" профспілки незалежні від органів державної влади, органів місцевого самоврядування, роботодавців (адміністрації університету), інших громадських організацій, політичних партій, їм не підзвітні і не підконтрольні. Профком студентів УжНУ співпрацює з адміністрацією університету на принципах соціального партнерства з усіх питань, що стосуються умов навчання, проживання та побуту студентів.</p>
        </div>
        </div>
    )
}

export default Home;