
import { useForm } from "react-hook-form";


const TrustBox = () => {

    const { register, handleSubmit } = useForm();
    const onSubmit = (data) => 
    
    console.log(JSON.stringify(data));
   
    return (
        <div>
            <h1 className='page-heading'> Скринька довіри</h1>
            <div className="trustBox-container">
                <div className='container-text'>
                    <p>Скринька довіри створена для того, аби поліпшити роботу університету. Ідеї та поради, як це зробити, пропозиції, побажання, зауваження про проблеми чи скарги на зловживання – вся інформація аналізується і враховується при ухваленні подальших управлінських рішень.</p><br/>
                    <p>Усі, кому небайдужа доля університету (студент, абітурієнт, співробітник, гість), можуть повідомити інформацію, важливу для забезпечення повноцінного функціювання та покращення діяльності УжНУ.</p><br/>
                    <p>Ви можете надсилати свої повідомлення про проблеми, які є в університеті, про можливі факти корупційних або пов’язаних з корупцією правопорушень. Усі повідомлення, у тому числі анонімні, будуть уважно вивчатися й опрацьовуватися.</p><br/>
                    <p>Профспілкова організація студентів гарантує повну конфіденційність. Доступ до відповідей має тільки голова Профкому університету. Він в свою чергу аналізує, виносить на засідання президії та обговорює заявку з головами профбюро та керівництвом університету.</p><br/>
                    <p>*Електронна адреса потрібна для зворотнього зв`язку, якщо знадобиться додаткова інформація або для надання відповіді.</p>                
                
                </div>
                <div className='container-form'>
                    <form onSubmit={handleSubmit(onSubmit)}>
                        <input name="firstName" {...register} placeholder="Ваше ім'я (не обов'язково)" />
                        <input name="Email" {...register} placeholder="Ваше email (бажано)*" />
                        <input name="theme" {...register} placeholder="Тематика (бажано)" />
                        <textarea name="content" {...register} placeholder="Повідомлення" />
                        <input type="submit" value={'Відправити'} className="submit" />
                        
                    </form>
                </div>
            </div>
            
        </div>
    )
}

export default TrustBox;